Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Generally speaking the ones listed here are those most likely to affect performance metrics, but in the right circumstances one could observe non negligible impact from the other flags too.
ja_jp: 一般的に言えば、ここに挙げたものはパフォーマンス・メトリクスに影響を与える可能性が高いものですが、適切な状況下では、他のフラグからも無視できないほどの影響を受ける可能性があります。

source: Generally speaking the ones listed here are those most likely to affect performance metrics, but in the right circumstances one could observe non-negligible impact from the other flags too.
ja_jp: 一般的に言えば、ここに挙げたものはパフォーマンス・メトリクスに影響を与える可能性が高いものですが、適切な状況下では、他のフラグによる影響も無視できないものになるでしょう。

source: Generally, you shouldn't do state updates in a `GET` REST method, but here it makes trying things out simpler. Let's assume what's being written is a logging "side effect", rather than a meaningful state changes!
ja_jp: 一般的に、 `GET` REST メソッドで状態の更新を行うことはできませんが、 ここでは、試しやすくするために更新しています。ここで書き込まれるものは、意味のある状態の変更ではなく、 ログの「副作用」と考えることにしましょう。

source: Generate <<heap-dumps,heap dumps>> and inspect them with tools such as VisualVM or Eclipse MAT.
ja_jp: <<heap-dumps,heap dumps>> を生成し、VisualVMやEclipse MATなどのツールで検査する。

source: Generate Kubernetes resources from annotations
ja_jp: アノテーションから Kubernetes リソースを生成する

source: Generate X.509 certificates with Vault’s PKI Secret Engine.
ja_jp: VaultのPKI Secret EngineでX.509証明書を生成します。

source: Generate a changelog based on all commits from the last tag (if any) to the latest commit.
ja_jp: 最後のタグ（もしあれば）から最新のコミットまでのすべてのコミットを基にして、チェンジログを生成します。

source: Generate a development CA
ja_jp: 開発 CA の生成

source: Generate a new `Command` based on the nodejs code available in https://github.com/vert-x3/vertx-redis-client[`vertx-redis-client`] repository:
ja_jp: link:https://github.com/vert-x3/vertx-redis-client[`vertx-redis-client`]リポジトリで公開されているnodejsのコードに基づいて、新しい `Command` を生成

source: Generate extension description files.
ja_jp: エクステンションの説明ファイルを生成します。

source: Generate the AOT cache from integration tests
ja_jp: 統合テストから AOT キャッシュを生成する

source: Generate the bytecode of the `Contextual#create(CreationalContext<T>)` method directly via `ExtendedBeanConfigurator.creator(Consumer<MethodCreator>)`.
ja_jp: `Contextual#create(CreationalContext<T>)` メソッドのバイトコードを、 `ExtendedBeanConfigurator.creator(Consumer<MethodCreator>)` を介して直接生成します。

source: Generate the bytecode of the `jakarta.enterprise.context.spi.Contextual#create(CreationalContext<T>)` implementation.
ja_jp: `jakarta.enterprise.context.spi.Contextual#create(CreationalContext<T>)` 実装のバイトコードを生成します。

source: Generate the bytecode of the `javax.enterprise.context.spi.Contextual#create(CreationalContext<T>)` implementation.
ja_jp: `javax.enterprise.context.spi.Contextual#create(CreationalContext<T>)` 実装の培土コードを生成します。

source: Generate the initial dataset.
ja_jp: 初期データセットを生成します。

source: Generate the legacy project
ja_jp: レガシープロジェクトを生成する

source: Generate values for the metrics.
ja_jp: メトリクスの値を作成します。

source: Generate xref:heap-dumps[heap dumps] and inspect them with tools such as VisualVM or Eclipse MAT.
ja_jp: xref:heap-dumps[ヒープダンプ] を生成し、VisualVMやEclipse MATなどのツールで検査する。

source: GenerateToken main Driver Class
ja_jp: GenerateToken メインドライバークラス

source: Generated AsciiDoc (`adoc` files) describing configuration properties in the `target/asciidoc/generated/config/` directory.
ja_jp: `target/asciidoc/generated/config/` ディレクトリに自動生成の設定プロパティを記述したAsciiDoc（ `adoc` ファイル）

source: Generated Asciidoc files describing configuration properties in the `target/asciidoc/generated/config/` directory.
ja_jp: `target/asciidoc/generated/config/` ディレクトリー内の設定プロパティーを記述する生成された Asciidoc ファイル。

source: Generated Client Proxy Example
ja_jp: 生成されたクライアントプロキシーの例

source: Generated Code
ja_jp: 生成されたコード

source: Generated by quarkus-oidc
ja_jp: quarkus-oidc によって生成

source: Generated migration files follow the following pattern:
ja_jp: 生成されるマイグレーションファイルは以下のパターンに従います。

source: Generates Java bytecode from WebAssembly modules, thus replacing the Chicory Maven plugin.
ja_jp: WebAssembly モジュールから Java バイトコードを生成し、Chicory Maven プラグインを置き換えます。

source: Generates a `AdditionalStaticResourceBuildItem` only on normal mode.
ja_jp: 通常モードでのみ `AdditionalStaticResourceBuildItem` を生成します。

source: Generates a `GeneratedResourceBuildItem`.
ja_jp: `GeneratedResourceBuildItem` を生成します。

source: Generates resources that are persisted in production mode.
ja_jp: 本番モードで永続化されるリソースを生成します。

source: Generates static resources (e.g., files like JavaScript, HTML, or CSS) served by Vertx.
ja_jp: Vertx によって提供される静的リソース (JavaScript、HTML、CSS などのファイルなど) を生成します。

source: Generates the bundle without building the native executable
ja_jp: ネイティブ実行可能ファイルをビルドせずにバンドルを生成

source: Generating AppCDS archive
ja_jp: AppCDS アーカイブの生成

source: Generating Bytecode
ja_jp: バイトコードの生成

source: Generating CronJob resources
ja_jp: CronJob リソースの生成

source: Generating CycloneDX BOMs
ja_jp: CycloneDX BOM の生成

source: Generating Descriptor Set
ja_jp: 記述子セットの生成

source: Generating JAX-RS resources with Panache
ja_jp: Panacheを利用したJAX-RSリソースの生成

source: Generating Jakarta REST resources with Panache
ja_jp: PanacheでJakarta RESTリソースを生成する

source: Generating Java files from proto with protobuf-maven-plugin
ja_jp: protoファイルからprotobuf-maven-pluginでJavaファイルを生成する

source: Generating Java files from proto with the protobuf-maven-plugin
ja_jp: proto から protobuf-maven-plugin で Java ファイルを生成する

source: Generating Job resources
ja_jp: Job リソースの生成

source: Generating Keys with OpenSSL
ja_jp: OpenSSL を使用した鍵の生成

source: Generating RBAC resources
ja_jp: RBACリソースの生成

source: Generating Resources
ja_jp: リソースの生成

source: Generating a JWT
ja_jp: JWT の生成

source: Generating a JWT with the appropriate claims to match the configuration.
ja_jp: 設定に一致する適切なクレームを含む JWT を生成する。

source: Generating a UUID for the first time
ja_jp: 初めて UUID を生成する動作

source: Generating a cache key with `CacheKeyGenerator`
ja_jp: `CacheKeyGenerator` でキャッシュキーを生成する

source: Generating a self-signed certificate
ja_jp: 自己署名証明書の生成

source: Generating a token
ja_jp: トークンの生成

source: Generating a trusted (signed) certificate
ja_jp: 信頼済み (署名済み) 証明書の生成

source: Generating an AOT cache during integration tests
ja_jp: インテグレーションテスト中の AOT キャッシュの生成

source: Generating example client code (e.g., `javascript` client for REST endpoints)
ja_jp: サンプルクライアントコードの生成 (例: REST エンドポイント用の `javascript` クライアント)

source: Generating flame graphs is slow, or produces errors, what can I do?
ja_jp: フレームグラフの生成に時間がかかったり、エラーが発生したりするのですが、どうすればいいですか？

source: Generating idempotent resources
ja_jp: 冪等性リソースの生成

source: Generating javadoc for your code
ja_jp: コードに対する Javadoc の生成

source: Generating keys with OpenSSL
ja_jp: OpenSSL でのキーの生成

source: Generating multiple OpenAPI documents
ja_jp: 複数の OpenAPI ドキュメントの生成

source: Generating resources
ja_jp: リソースの生成

source: Generating test code for your application
ja_jp: アプリケーションのテストコードの生成

source: Generating test data for your application
ja_jp: アプリケーションのテストデータの生成

source: Generating the AOT cache
ja_jp: AOT キャッシュの生成

source: Generating the DAO and mapper implementations
ja_jp: DAOとマッパーの実装の生成

source: Generating the documentation
ja_jp: ドキュメントの生成

source: Generating the documentation is easy:
ja_jp: ドキュメントの生成は簡単です。

source: Generating your Extension Codestart
ja_jp: エクステンションcodestartの生成

source: Generation does not support collections such as `List<Fruit>`. Refer to <<jackson-serialization>> to write your own serializer/deserializer for this case.
ja_jp: 生成は、 `List<Fruit>` のようなコレクションをサポートしていません。 <<jackson-serialization>> を参照して、独自のシリアライザー/デシリアライザーを作成します。

source: Generation does not support collections such as `List<Fruit>`. Refer to xref:jackson-serialization[Serializing via Jackson] to write your own serializer/deserializer for this case.
ja_jp: 生成 は、 `List<Fruit>` のようなコレクションをサポートしていません。このような場合のために独自のシリアライザー/デシリアライザーを作成するには、 xref:jackson-serialization[Jacksonによるシリアライジング] を参照してください。

source: Georgios once again resorted to bytecode rewriting to eliminate the annotation lookup. Again, this isn't something we want to maintain in the long term.
ja_jp: Georgios は再びバイトコードの書き換えを利用して、アノテーションのルックアップを排除しました。これもまた、長期的にメンテナンスしたいものではありません。

source: Get Help
ja_jp: ヘルプ

source: Get Involved
ja_jp: 参加する

source: Get Started
ja_jp: 入門

source: Get Trigger metadata for a specific scheduled job by its identity.
ja_jp: スケジュールされた特定のメソッドを、そのIDで再開する。

source: Get `OidcConfigurationMetadata`, which contains all supported OIDC endpoint addresses.
ja_jp: サポートされているすべての OIDC エンドポイントアドレスが含まれる `OidcConfigurationMetadata` を取得します。

source: Get a CDI portable extension running
ja_jp: CDI ポータブルエクステンションを動作させる

source: Get a URL to test your application. To do so, ensure you have exposed an {openshift} route by setting the `quarkus.openshift.route.expose=true` property in the `application.properties` file before building the application.
ja_jp: アプリケーションをテストするための URL を取得します。 そのためには、アプリケーションをビルドする前に `application.properties` ファイルで `quarkus.openshift.route.expose=true` プロパティを設定し、{openshift} ルートを公開しているようにしてください。

source: Get a framework running
ja_jp: 実行中のフレームワークを取得する

source: Get a hold of the generated `OpenAPI` Schema, and enhance as required
ja_jp: 生成された `OpenAPI` スキーマを取得し、必要に応じて強化します。

source: Get a list of services:
ja_jp: サービス一覧

source: Get all known classes from the index
ja_jp: インデックスからすべての既知のクラスを取得

source: Get all pages of your namespace
ja_jp: 名前空間のすべてのページを取得します

source: Get an `Iterator` for the `RowSet` result.
ja_jp: `RowSet` の結果に対して `Iterator` を取得します。

source: Get an application logger
ja_jp: アプリケーションロガーの取得

source: Get better performances.
ja_jp: パフォーマンスの向上

source: Get better support for unit and integration testing.
ja_jp: ユニットテストや統合テストの充実したサポート

source: Get by ID
ja_jp: IDによるGet

source: Get early test feedback with Continuous Testing.
ja_jp: 継続的テストにより、早期にテストのフィードバックを得ることができます。

source: Get instant feedback on code changes as tests run in the background on impacted code.
ja_jp: 影響を受けたコードに対してテストがバックグラウンドで実行されるため、コードの変更に関するフィードバックを即座に得ることができます。

source: Get it running
ja_jp: 実行

source: Get new and deeper views into Quarkus from the community through <a href="{{site.baseurl}}/books">these great books</a>.
ja_jp: <a href="{{site.baseurl}}/books">これらの素晴らしい本</a>を通じてコミュニティからQuarkusについて新しく、深い洞察を得てください。

source: Get rid of shutdown logic
ja_jp: シャットダウンロジックの排除

source: Get rid of static fields on the extension processor
ja_jp: エクステンションプロセッサーの静的フィールドの排除

source: Get started
ja_jp: 入門

source: Get started with Quarkus Security by securing your Quarkus application endpoints with the built-in Quarkus Basic authentication and the Jakarta Persistence identity provider, enabling role-based access control.
ja_jp: 組込のQuarkus Basic認証とJakarta Persistence IDプロバイダーによってQuarkusアプリケーションのエンドポイントを保護し、ロールベースのアクセス制御を可能にするQuarkus Security入門

source: Get started with Quarkus Security by securing your Quarkus application endpoints with the built-in Quarkus xref:security-basic-authentication.adoc[Basic authentication] and the Jakarta Persistence identity provider, enabling role-based access control.
ja_jp: Quarkus Security を使い始めるには、Quarkus アプリケーションのエンドポイントを組み込みの Quarkus の xref:security-basic-authentication.adoc[Basic 認証] と Jakarta Persistence の ID プロバイダーでセキュアにし、ロールベースアクセス制御を有効にします。

source: Get started with configuring `datasources` in Quarkus
ja_jp: Quarkusでの `datasources` の設定入門

source: Get started with virtual threads with Quarkus REST
ja_jp: Quarkus REST で仮想スレッドを使い始める

source: Get started with virtual threads with RESTEasy Reactive
ja_jp: RESTEasy Reactiveで仮想スレッド入門

source: Get the FQCN of the class
ja_jp: クラスのFQCNを取得

source: Get the OIDC tenant configuration.
ja_jp: OIDC テナント設定を取得します。

source: Get the greeting by id as the key
ja_jp: id をキーに Greeting POJO を取得します。

source: Get the list of Kubernetes services.
ja_jp: Kubernetesのサービスの一覧を取得します。

source: Get the list of exposed routes.
ja_jp: 公開されているルートのリストを取得します。

source: Get the list of pods.
ja_jp: ポッドのリストを取得します。

source: Get the response data as String.
ja_jp: レスポンスデータを文字列として取得します。

source: Get your versioned extension documentation automatically published (including guides)! Quarkiverse Hub uses https://antora.org[Antora] to aggregate each extension documentation in the Quarkiverse docs website. Although the layout is still a work in progress, you can check it out at https://quarkiverse.github.io/quarkiverse-docs/
ja_jp: バージョン管理されたエクステンションドキュメント(ガイドを含む)を自動的に公開しましょう!Quarkiverse Hubでは、 https://antora.org[Antora]を使用して、Quarkiverse docsのウェブサイト内の各エクステンションドキュメントを集約しています。レイアウトはまだ作業中ですが、 https://quarkiverse.github.io/quarkiverse-docs/ で確認できます。

source: Get, set, list, and delete push notification configurations
ja_jp: プッシュ通知設定の取得、設定、一覧表示、および削除

source: Getters defined in an interface will define the GraphQL fields that it contains
ja_jp: インターフェイスで定義されたゲッターは、それが含むGraphQLフィールドを定義します。

source: Getting Help from the Community
ja_jp: コミュニティーからのヘルプ

source: Getting Started
ja_jp: はじめに

source: Getting Started With Reactive
ja_jp: リアクティブ入門

source: Getting Started to Quarkus Messaging with AMQP 1.0
ja_jp: AMQP 1.0を使用したQuarkusのメッセージング入門

source: Getting Started to Quarkus Messaging with Apache Kafka
ja_jp: Apache Kafkaを使用したQuarkusメッセージング入門

source: Getting Started to Quarkus Messaging with Apache Pulsar
ja_jp: Apache PulsarによるQuarkusメッセージングの開始

source: Getting Started to Quarkus Messaging with RabbitMQ
ja_jp: RabbitMQを使用したQuarkusメッセージング入門

source: Getting Started to SmallRye Reactive Messaging with AMQP 1.0
ja_jp: AMQP 1.0 を使用した SmallRye Reactive Messaging を使い始める

source: Getting Started to SmallRye Reactive Messaging with Apache Kafka
ja_jp: Apache Kafka を使用した SmallRye Reactive Messaging の概要

source: Getting Started to SmallRye Reactive Messaging with Apache Pulsar
ja_jp: Apache PulsarによるSmallRyeリアクティブ・メッセージング入門

source: Getting Started to SmallRye Reactive Messaging with RabbitMQ
ja_jp: RabbitMQによるSmallRyeリアクティブメッセージング入門

source: Getting Started with AMQP in your Quarkus application
ja_jp: QuarkusアプリケーションでのAMQP入門

source: Getting Started with Apache Kafka in your Quarkus application
ja_jp: QuarkusアプリケーションでApache Kafkaを開始する

source: Getting Started with Cryostat
ja_jp: Cryostat入門

source: Getting Started with Quarkus Qute Templating Extension
ja_jp: Quarkus Qute Templating Extension入門

source: Getting Started with Reactive
ja_jp: リアクティブ入門

source: Getting Started with SmallRye Stork
ja_jp: SmallRye Stork入門

source: Getting Started with gRPC
ja_jp: gRPC入門

source: Getting a library to run in native was facilitated by the very good documentation that comes from the Quarkus project and support in the framework (e.g. _processors_ and _recorders_): https://quarkus.io/guides/writing-native-applications-tips#native-in-extension[Supporting native in a Quarkus extension].
ja_jp: ライブラリをネイティブで動作させるには、Quarkusプロジェクトから提供される非常に優れたドキュメントと、フレームワークでのサポート（ _プロセッサ_や _レコーダー_など）が役立ちました。 link:https://quarkus.io/guides/writing-native-applications-tips#native-in-extension[Quarkusのエクステンションでネイティブをサポートする]。

source: Getting an admin access token
ja_jp: 管理者アクセストークンの取得

source: Getting other response properties
ja_jp: その他のレスポンスプロパティーの取得

source: Getting started
ja_jp: はじめに

source: Getting started materials
ja_jp: 入門用資料

source: Getting started with Cryostat on OpenShift is quick and easy - just install it from OperatorHub:
ja_jp: OpenShiftでCryostatを始めるには、OperatorHubからインストールするだけで、素早く簡単にできます。

source: Getting started with Quarkus Security
ja_jp: Quarkus セキュリティー入門

source: Getting started with Security by using Basic authentication and Jakarta Persistence
ja_jp: Basic認証とJakarta Persistenceを使ったセキュリティ入門

source: Getting started with WebSockets Next
ja_jp: WebSockets Next入門

source: Getting started with security by using Basic authentication and Jakarta Persistence
ja_jp: Basic認証とJakarta Persistenceを使用したセキュリティの入門

source: Getting you ready
ja_jp: 準備

source: GitHub Discussions is a new feature and we are looking forward to see what everyone will do with it. If you have feedback do tell us in https://github.com/quarkusio/quarkus/discussions/categories/community[Community discussions] or even put as comment on this blog.
ja_jp: GitHub Discussionsは新しい機能で、私たちは皆さんがこの機能を使って何をするのか楽しみにしています。ご意見・ご感想がありましたら、 link:https://github.com/quarkusio/quarkus/discussions/categories/community[コミュニティ・ディスカッション]やこのブログにコメントをお寄せください。

source: GitHub automatically adds the `area/documentation` label to pull requests that contain changes to documentation files.
ja_jp: GitHub は、ドキュメントファイルへの変更を含むプルリクエストに `area/documentation` ラベルを自動的に追加します。

source: GitHub repository: https://github.com/redhat-developer/intellij-quarkus
ja_jp: GitHub リポジトリ: https://github.com/redhat-developer/intellij-quarkus

source: GitHub repository: https://github.com/redhat-developer/vscode-quarkus
ja_jp: GitHubレポジトリ: https://github.com/redhat-developer/vscode-quarkus

source: Give it 5 seconds during which circuit breaker should close and you should be able to make two successful requests again.
ja_jp: 5秒後にサーキットブレーカーが閉じて、再び2回のリクエストを成功させることができます。

source: Give it 5 seconds during which circuit breaker should close, and you should be able to make two successful requests again.
ja_jp: 5秒後にサーキットブレーカーが閉じて、再び2回のリクエストを成功させるようになります。

source: Give you the freedom to manage the project and release to Maven Central as you like.
ja_jp: プロジェクトを管理し、好きなように Maven Central にリリースする自由を与えます。

source: Given a default non-application endpoint root of `/q`, this will create an endpoint at `/q/custom-endpoint/deep`.
ja_jp: デフォルトの非アプリケーションエンドポイントルートが `/q` の場合、 `/q/custom-endpoint/deep` にエンドポイントが作成されます。

source: Given a native executable, various Linux tools can be used to inspect it. To allow supporting a variety of environments, inspections will be done from within a Linux container. Let's create a Linux container image with all the tools required for this guide:
ja_jp: ネイティブ実行可能ファイルを指定すると、さまざまな Linux ツールを使用して実行可能ファイルを検査できます。さまざまな環境をサポートできるように、検査は Linux コンテナー内から実行されます。このガイドに必要なすべてのツールを使用して、Linux コンテナーイメージを作成しましょう。

source: Given that `quarkus-extension-b` includes a dependency condition, Quarkus will interpret an optional dependency on the `quarkus-extension-b` as conditional.
ja_jp: `quarkus-extension-b` に依存条件が含まれている場合、Quarkus は `quarkus-extension-b` に対するオプションの依存関係を条件付きとして解釈します。

source: Given that `quarkus.oidc.token-state-manager.encryption-required` is set to `true` by default, a custom `io.quarkus.oidc.TokenStateManager` implementation must encrypt tokens before storing them by default. However, it does not have to encrypt tokens itself, they will be encrypted by the time it is asked to store them.
ja_jp: `quarkus.oidc.token-state-manager.encryption-required` はデフォルトで `true` に設定されているため、カスタムの `io.quarkus.oidc.TokenStateManager` 実装は、デフォルトでトークンを保存する前に暗号化する必要があります。ただし、実装自体がトークンを暗号化する必要はありません。保存を求められる時点ですでに暗号化されています。

source: Given that complexity we created our own tool for configuration and deployment. The initial version was based on Ansible and ran into Tower workflows. For different reasons we decided to rewrite it in Java a year ago, mainly to:
ja_jp: その複雑さを考慮して、私たちは設定とデプロイのための独自のツールを作成しました。最初のバージョンはAnsibleをベースにしたもので、Towerのワークフローに対応していました。さまざまな理由から、1年前にJavaで書き直すことにしました。主な理由は:

source: Given that configuration sources usually provide more options than actually used during the build, it might be useful to know which configuration options have actually been used during a Quarkus build process.
ja_jp: 設定ソースは通常、ビルド中に実際に使用されるよりも多くのオプションを提供するため、Quarkusのビルドプロセスで実際に使用された設定オプションを知ることは有益です。

source: Given that every member-specific BOM is actually a fragment of the `io.quarkus:quarkus-universe-bom`, member BOMs can be imported in any order w/o creating a conflict.
ja_jp: すべてのメンバー固有のBOMは実際には `io.quarkus:quarkus-universe-bom` の断片であるため、メンバーのBOMはコンフリクトを起こさずにどのような順序でもインポートすることができます。

source: Given that only a single provider of a given capability is allowed in an application, capability prefixes allow expressing a certain common aspect among different but somewhat related capabilities. E.g. there could be extensions providing the following capabilities:
ja_jp: 1つのアプリケーションでは特定のケイパビリティの単一のプロバイダーしか認められないことを考えると、ケイパビリティのプレフィックスによって、異なるが多少関連するケイパビリティの間である共通の側面を表現することができます。例えば、以下のようなケイパビリティを提供するエクステンションがあるかもしれません:

source: Given that the plugin is not aware of how Quarkus uses these dependencies, it will not be able to set the `quarkus:component:scope` property for components. On the other hand, the requested configuration name can be used indicate which scope to target.
ja_jp: プラグインは Quarkus がこれらの依存関係をどのように使用するかを認識しないため、コンポーネントの `quarkus:component:scope` プロパティーを設定することはできません。一方で、リクエストされた設定名を使用して、ターゲットとするスコープを示すことはできます。

source: Given that the project does not include any Camel Quarkus extensions, the BOM import is recommended to be removed
ja_jp: プロジェクトにCamel Quarkusエクステンションが含まれていないことから、BOMインポートを削除することが推奨されます。

source: Given that the project does not include any Kogito extensions, the BOM import is recommended to be removed
ja_jp: プロジェクトに Kogito エクステンションが含まれていないことを考えると、BOM インポートを削除することをお勧めします

source: Given that, Panache already provides the necessary plumbing to transparently find the appropriate `EntityManager` associated to a Panache entity.
ja_jp: そう考えると、Panacheはすでに、Panacheエンティティに関連する適切な `EntityManager` を透過的に見つけるために必要な導線を提供しています。

source: Given the Wiremock-based resource above, the first test invocation should return the `access_token_1` access token, which will expire in 4 seconds. Use `awaitility` to wait for about 5 seconds. The next test invocation should return the `access_token_2` access token, which confirms the expired `access_token_1` access token has been refreshed.
ja_jp: 上記の Wiremock ベースのリソースが与えられた場合、最初のテスト呼び出しでは `access_token_1` アクセストークンが返されます。このトークンは 4 秒で期限切れになります。`awaitility` を使用して約 5 秒間待機します。次のテスト呼び出しでは `access_token_2` アクセストークンが返され、期限切れになった `access_token_1` アクセストークンが更新されたことを確認できます。

source: Given the above permission set, `GET /api/foo` would match both permission sets' paths, so would require both the `user` and `admin` roles.
ja_jp: 上記のパーミッションセットを考えると、 `GET /api/foo` は両方のパーミッションセットのパスにマッチするので、 `user` と `admin` の両方のロールが必要になります。

source: Given the above permission set, `GET /api/foo` would match both permission sets' paths, requiring both the `user` and `admin` roles.
ja_jp: 上記のパーミッションセットの場合、 `GET /api/foo` は両方のパーミッションセットのパスにマッチするので、 `user` と `admin` の両方のロールが必要になります。

source: Given the above permission set, `GET /public/foo` would match both permission sets' paths, but because it matches the `permit1` permission set's explicit method, `permit1` will be chosen and the request will be accepted. `PUT /public/foo` on the other hand, will not match the method permissions of `permit1` and so `deny1` will be activated and reject the request.
ja_jp: 上記のパーミッションセットの場合、 `GET /public/foo` は両方のパーミッションセットのパスにマッチしますが、 `permit1` パーミッションセットの明示的なメソッドにマッチするので、 `permit1` が選択されてリクエストが受理されることになります。一方、 `PUT /public/foo` は `permit1` のメソッドパーミッションにマッチしないので、 `deny1` が有効になり、リクエストが拒否されます。

source: Given the above permission set, `GET /public/foo` would match both the path and method and thus be allowed, whereas `POST /public/foo` would match the path but not the method and would thus be rejected.
ja_jp: 上記のパーミッションセットの場合、 `GET /public/foo` はパスとメソッドの両方にマッチするので許可されますが、 `POST /public/foo` はパスにマッチしますがメソッドにはマッチしないので拒否されます。

source: Given the above permission set, `GET /public/foo` would match the paths of both permission sets, but because it fits the explicit method of the `permit1` permission set, `permit1` is chosen, and the request is accepted.
ja_jp: 上記のパーミッション・セットの場合、 `GET /public/foo` は両方のパーミッション・セットのパスに合致しますが、 `permit1` のパーミッション・セットの明示的な方法に合致するため、 `permit1` が選択され、リクエストは受理されます。

source: Given the above permission set, `GET /public/forbidden-folder/foo` would match both permission sets' paths, but because it matches the `deny1` permission set's path on a longer match, `deny1` will be chosen and the request will be rejected.
ja_jp: 上記のパーミッションセットを考えると、 `GET /public/forbidden-folder/foo` は両方のパーミッションセットのパスにマッチしますが、より長いマッチで `deny1` パーミッションセットのパスにマッチするので、 `deny1` が選択されてリクエストは拒否されます。
